{
    "date": "2023-04-30",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2428 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository thorsten/phpmyfaq prior to 3.1.13.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-29",
    "from_channel": "defcon_news",
    "message": "Apache Superset Shipped With Unpatched RCE Vulnerability\nhttps://latesthackingnews.com/2023/04/29/apache-superset-shipped-with-unpatched-rce-vulnerability/",
    "webpage_description": "Researchers spotted a severe unpatched remote code execution vulnerability shipped by default in Apache Superset. The vulnerability existed due to a dangerous default configuration, making thousands of Superset instances open to the public. Apache Superset Has",
    "webpage_url": "https://latesthackingnews.com/2023/04/29/apache-superset-shipped-with-unpatched-rce-vulnerability/"
}
{
    "date": "2023-04-29",
    "from_channel": "proxy_bar",
    "message": "И еще раз о CVE-2023-29489 cPanel и XSS\nFinding XSS in a million websites\n\n#cPanel #xss"
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-23647 ‼\n\nCross Site Scripting (XSS) vulnerability in BoxBilling 4.19, 4.19.1, 4.20, and 4.21 allows remote attackers to run arbitrary code via the message field on the submit new ticket form.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30405 ‼\n\nA cross-site scripting (XSS) vulnerability in Aigital Wireless-N Repeater Mini_Router v0.131229 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the wl_ssid parameter at /boafrm/formHomeWlanSetup.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26813 ‼\n\nSQL injection vulnerability in com.xnx3.wangmarket.plugin.dataDictionary.controller.DataDictionaryPluginController.java in wangmarket CMS 4.10 allows remote attackers to run arbitrary SQL commands via the TableName parameter to /plugin/dataDictionary/tableView.do.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26781 ‼\n\nSQL injection vulnerability in mccms 2.6 allows remote attackers to run arbitrary SQL commands via Author Center ->Reader Comments ->Search.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-21643 ‼\n\nCross Site Scripting (XSS) vulnerability in HongCMS 3.0 allows attackers to run arbitrary code via the callback parameter to /ajax/myshop.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30125 ‼\n\nEyouCms V1.6.1-UTF8-sp1 is vulnerable to Cross Site Scripting (XSS).\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2371 ‼\n\nA vulnerability classified as critical was found in SourceCodester Online DJ Management System 1.0. Affected by this vulnerability is an unknown functionality of the file admin/inquiries/view_details.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227647.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28819 ‼\n\nConcrete CMS (previously concrete5) before 9.1 is vulnerable to Stored XSS in uploaded file and folder names.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28820 ‼\n\nConcrete CMS (previously concrete5) before 9.1 is vulnerable to stored XSS in RSS Displayer via the href attribute because the link element input was not sanitized.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28476 ‼\n\nConcrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS on Tags on uploaded files.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2370 ‼\n\nA vulnerability classified as critical has been found in SourceCodester Online DJ Management System 1.0. Affected is an unknown function of the file admin/events/manage_event.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-227646 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30123 ‼\n\nwuzhicms v4.1.0 is vulnerable to Cross Site Scripting (XSS) in the Member Center, Account Settings.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28475 ‼\n\nConcrete CMS (previously concrete5) before 9.2 is vulnerable to Reflected XSS on the Reply form because msgID was not sanitized.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28474 ‼\n\nConcrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS on Saved Presets on search.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30183 ‼\n\nWangmarket CMS v4.10 was discovered to contain a SQL injection vulnerability via the component /plugin/dataDictionary/tableView.do?tableName=.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28471 ‼\n\nConcrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS via a container name.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2368 ‼\n\nA vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file index.php?page=manage_questionnaire. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227644.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2369 ‼\n\nA vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been rated as critical. This issue affects some unknown processing of the file admin/manage_restriction.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227645 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2367 ‼\n\nA vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/manage_academic.php. The manipulation of the argument id leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227643.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2366 ‼\n\nA vulnerability was found in SourceCodester Faculty Evaluation System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file ajax.php?action=delete_class. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-227642 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2365 ‼\n\nA vulnerability has been found in SourceCodester Faculty Evaluation System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file ajax.php?action=delete_subject. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227641 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "defcon_news",
    "message": "Piwigo 13.5.0 SQL Injection\nhttps://packetstormsecurity.com/files/172059/TSI-ADV032023.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/172059/TSI-ADV032023.txt"
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30467 ‼\n\nThis vulnerability exists in Milesight 4K/H.265 Series NVR models (MS-Nxxxx-xxG, MS-Nxxxx-xxE, MS-Nxxxx-xxT, MS-Nxxxx-xxH and MS-Nxxxx-xxC), due to improper authorization at the Milesight NVR web-based management interface. A remote attacker could exploit this vulnerability by sending a specially crafted http requests on the targeted device.Successful exploitation of this vulnerability could allow remote attacker to perform unauthorized activities on the targeted device.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2363 ‼\n\nA vulnerability, which was classified as critical, has been found in SourceCodester Resort Reservation System 1.0. This issue affects some unknown processing of the file view_room.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227639.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30466 ‼\n\nThis vulnerability exists in Milesight 4K/H.265 Series NVR models (MS-Nxxxx-xxG, MS-Nxxxx-xxE, MS-Nxxxx-xxT, MS-Nxxxx-xxH and MS-Nxxxx-xxC), due to a weak password reset mechanism at the Milesight NVR web-based management interface. A remote attacker could exploit this vulnerability by sending a specially crafted http requests on the targeted device.Successful exploitation of this vulnerability could allow remote attacker to account takeover on the targeted device.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-28",
    "from_channel": "RalfHackerChannel",
    "message": "Microsoft Exchange Powershell Remoting Deserialization leading to RCE (CVE-2023-21707) \n\n👤 by testanull\n\nWhile analyzing CVE-2022-41082, also known as Proxy Not Shell, researcher discovered CVE-2023-21707 vulnerability which he has detailed in this blog.\nThe vulnerability allows a privileged user to trigger RCE during a deserialization of untrusted data.\n\n📝 Contents:\n● Introduction \n● The new variant\n● Payload delivery\n● Demo\n● References\n\nhttps://starlabs.sg/blog/2023/04-microsoft-exchange-powershell-remoting-deserialization-leading-to-rce-cve-2023-21707/"
}
{
    "date": "2023-04-28",
    "from_channel": "proxy_bar",
    "message": "CVE-2023-29489\ncPanel\n\n#cPanel #xss"
}
{
    "date": "2023-04-28",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2361 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29489 ‼\n\nAn issue was discovered in cPanel before 11.109.9999.116. XSS can occur on the cpsrvd error page via an invalid webcall ID, aka SEC-669. The fixed versions are 11.109.9999.116, 11.108.0.13, 11.106.0.18, and 11.102.0.31.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-21712 ‼\n\nWindows Point-to-Point Tunneling Protocol Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "defcon_news",
    "message": "ChurchCRM 4.5.3 SQL Injection\nhttps://packetstormsecurity.com/files/172047/churchcrm453event-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/172047/churchcrm453event-sql.txt"
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30852 ‼\n\nPimcore is an open source data and experience management platform. Prior to version 10.5.21, the `/admin/misc/script-proxy` API endpoint that is accessible by an authenticated administrator user is vulnerable to arbitrary JavaScript and CSS file read via the `scriptPath` and `scripts` parameters. The `scriptPath` parameter is not sanitized properly and is vulnerable to path traversal attack. Any JavaScript/CSS file from the application server can be read by specifying sufficient number of `../` patterns to go out from the application webroot followed by path of the folder where the file is located in the \"scriptPath\" parameter and the file name in the \"scripts\" parameter. The JavaScript file is successfully read only if the web application has read access to it. Users should update to version 10.5.21 to receive a patch or, as a workaround, apply the patch manual.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30850 ‼\n\nPimcore is an open source data and experience management platform. Prior to version 10.5.21, a SQL Injection vulnerability exists in the admin translations API. Users should update to version 10.5.21 to receive a patch or, as a workaround, or apply the patch manually.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30849 ‼\n\nPimcore is an open source data and experience management platform. Prior to version 10.5.21, A SQL injection vulnerability exists in the translation export API. Users should update to version 10.5.21 to receive a patch or, as a workaround, or apply the patch manually.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30848 ‼\n\nPimcore is an open source data and experience management platform. Prior to version 10.5.21, the admin search find API has a SQL injection vulnerability. Users should upgrade to version 10.5.21 to receive a patch or, as a workaround, apply the patch manually.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2342 ‼\n\nCross-site Scripting (XSS) - Reflected in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2348 ‼\n\nA vulnerability was found in SourceCodester Service Provider Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /admin/user/manage_user.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227591.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30349 ‼\n\nJFinal CMS v5.1.0 was discovered to contain a remote code execution (RCE) vulnerability via the ActionEnter function.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2343 ‼\n\nCross-site Scripting (XSS) - DOM in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2346 ‼\n\nA vulnerability was found in SourceCodester Service Provider Management System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/inquiries/view_inquiry.php. The manipulation of the argument id leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227589 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30338 ‼\n\nMultiple stored cross-site scripting (XSS) vulnerabilities in Emlog Pro v2.0.3 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the Article Title or Article Summary parameters.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2347 ‼\n\nA vulnerability was found in SourceCodester Service Provider Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /admin/services/manage_service.php. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-227590 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2341 ‼\n\nCross-site Scripting (XSS) - Generic in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2344 ‼\n\nA vulnerability has been found in SourceCodester Service Provider Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /classes/Master.php?f=save_service of the component HTTP POST Request Handler. The manipulation of the argument name leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227587.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2339 ‼\n\nCross-site Scripting (XSS) - Reflected in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2328 ‼\n\nCross-site Scripting (XSS) - Generic in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2327 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28770 ‼\n\nThe sensitive information exposure vulnerability in the CGI â€œExport_Logâ€� and the binary â€œzcmdâ€� in Zyxel DX5401-B0 firmware versions prior to V5.17(ABYO.1)C0 could allow a remote unauthenticated attacker to read the system files and to retrieve the password of the supervisor from the encrypted file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2323 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository pimcore/pimcore prior to 10.5.21.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-22901 ‼\n\nChangingTec MOTP system has a path traversal vulnerability. A remote attacker with administratorâ€™s privilege can exploit this vulnerability to access arbitrary system files.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2297 ‼\n\nThe Profile Builder â€“ User Profile & User Registration Forms plugin for WordPress is vulnerable to unauthorized password resets in versions up to, and including 3.9.0. This is due to the plugin using native password reset functionality, with insufficient validation on the password reset function (wppb_front_end_password_recovery). The function uses the plaintext value of a password reset key instead of a hashed value which means it can easily be retrieved and subsequently used. An attacker can leverage CVE-2023-0814, or another vulnerability like SQL Injection in another plugin or theme installed on the site to successfully exploit this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20852 ‼\n\naEnrich Technology a+HRD has a vulnerability of Deserialization of Untrusted Data within its MSMQ interpreter. An unauthenticated remote attacker can exploit this vulnerability to execute arbitrary system commands to perform arbitrary system operation or disrupt service.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-27",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20853 ‼\n\naEnrich Technology a+HRD has a vulnerability of Deserialization of Untrusted Data within its MSMQ asynchronized message process. An unauthenticated remote attacker can exploit this vulnerability to execute arbitrary system commands to perform arbitrary system operation or disrupt service.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29442 ‼\n\nZoho ManageEngine Applications Manager through 16390 allows DOM XSS.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28008 ‼\n\nHCL Workload Automation 9.4, 9.5, and 10.1 are vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28009 ‼\n\nHCL Workload Automation is vulnerable to an XML External Entity Injection (XXE) attack when processing XML data. A remote attacker could exploit this vulnerability to expose sensitive information or consume memory resources.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29443 ‼\n\nZoho ManageEngine ServiceDesk Plus through 14104 allows admin users to conduct an XXE attack.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30212 ‼\n\nOURPHP <= 7.2.0 is vulnerale to Cross Site Scripting (XSS) via /client/manage/ourphp_out.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30211 ‼\n\nOURPHP <= 7.2.0 is vulnerable to SQL Injection.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-27979 ‼\n\nA cross-site scripting (XSS) vulnerability in ToolJet v1.6.0 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the Comment Body component.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30210 ‼\n\nOURPHP <= 7.2.0 is vulnerable to Cross Site Scripting (XSS) via ourphp_tz.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "defcon_news",
    "message": "Reddit: Blind SSRF with Escalation possibilities in matrix preview_link API\nhttps://vulners.com/hackerone/H1:1960765?utm_source=rss&utm_medium=rss&utm_campaign=rss",
    "webpage_description": "Summary: Reddit' new chat is based on Matrix software which has preview_link functionality which doesn't filter the URL before sending the request Impact: Attacker can enumerate services by grabbing og:title and port scanning, also possible RCE...",
    "webpage_url": "https://vulners.com/hackerone/H1:1960765"
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30269 ‼\n\nCLTPHP <=6.0 is vulnerable to Improper Input Validation via application/admin/controller/Template.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30112 ‼\n\nMedicine Tracker System in PHP 1.0.0 is vulnerable to SQL Injection.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30267 ‼\n\nCLTPHP <=6.0 is vulnerable to Cross Site Scripting (XSS) via application/home/controller/Changyan.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-25273 ‼\n\nDrupal core's form API has a vulnerability where certain contributed or custom modules' forms may be vulnerable to improper input validation. This could allow an attacker to inject disallowed values or overwrite data. Affected forms are uncommon, but in certain cases an attacker could alter critical or sensitive data.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "defcon_news",
    "message": "PHP Restaurants 1.0 SQL Injection / Cross Site Scripting\nhttps://packetstormsecurity.com/files/172040/phprestaurants10-sqlxss.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/172040/phprestaurants10-sqlxss.txt"
}
{
    "date": "2023-04-26",
    "from_channel": "defcon_news",
    "message": "Online Book Store 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/172032/obs10process-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/172032/obs10process-sql.txt"
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30111 ‼\n\nMedicine Tracker System in PHP 1.0.0 is vulnerable to Cross Site Scripting (XSS).\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30106 ‼\n\nSourcecodester Medicine Tracker System in PHP 1.0.0 is vulnerable to Cross Site Scripting (XSS) via page=about.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-27843 ‼\n\nSQL injection vulnerability found in PrestaShop askforaquote v.5.4.2 and before allow a remote attacker to gain privileges via the QuotesProduct::deleteProduct component.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2012-5872 ‼\n\nARC (aka ARC2) through 2011-12-01 allows blind SQL Injection in getTriplePatternSQL in ARC2_StoreSelectQueryHandler.php via comments in a SPARQL WHERE clause.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2012-5873 ‼\n\nARC (aka ARC2) through 2011-12-01 allows reflected XSS via the end_point.php query parameter in an output=htmltab action.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30404 ‼\n\nAigital Wireless-N Repeater Mini_Router v0.131229 was discovered to contain a remote code execution (RCE) vulnerability via the sysCmd parameter in the formSysCmd function. This vulnerability is exploited via a crafted HTTP request.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-31223 ‼\n\nDradis before 4.8.0 allows persistent XSS by authenticated author users, related to avatars.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25461 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in namithjawahar Wp-Insert plugin <=Â 2.5.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-26",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23866 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Carlos Moreira Interactive Geo Maps plugin <=Â 1.5.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23889 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Fullworks Quick Paypal Payments pluginÂ <= 5.7.25 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23710 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in miniOrange WordPress Social Login and Register (Discord, Google, Twitter, LinkedIn) plugin <=Â 7.5.14 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24005 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Winwar Media Inline Tweet Sharer â€“ Twitter Sharing Plugin plugin <=Â 2.5.3 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23995 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Tim Reeves & David StÃ¶ckl TinyMCE Custom Styles pluginÂ <= 1.1.2 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2021-45071 ‼\n\nCross-site scripting (XSS) issue Odoo Community 15.0 and earlier and Odoo Enterprise 15.0 and earlier, allows remote attackers to inject arbitrary web script in the browser of a victim, via crafted uploaded file names.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30838 ‼\n\nPrestaShop is an Open Source e-commerce web application. Prior to versions 8.0.4 and 1.7.8.9, the `ValidateCore::isCleanHTML()` method of Prestashop misses hijackable events which can lead to cross-site scripting (XSS) injection, allowed by the presence of pre-setup `@keyframes` methods. This XSS, which hijacks HTML attributes, can be triggered without any interaction by the visitor/administrator, which makes it as dangerous as a trivial XSS attack. Contrary to other attacks which target HTML attributes and are triggered without user interaction (such as onload / onerror which suffer from a very limited scope), this one can hijack every HTML element, which increases the danger due to a complete HTML elements scope. Versions 8.0.4 and 1.7.8.9 contain a fix for this issue.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2021-26263 ‼\n\nCross-site scripting (XSS) issue in Discuss app of Odoo Community 14.0 through 15.0, and Odoo Enterprise 14.0 through 15.0, allows remote attackers to inject arbitrary web script in the browser of a victim, by posting crafted contents.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30177 ‼\n\nCraftCMS 3.7.59 is vulnerable Cross Site Scripting (XSS). An attacker can inject javascript code into Volume Name.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25314 ‼\n\nCross Site Scripting (XSS) vulnerability in World Wide Broadcast Network AVideo before 12.4, allows attackers to gain sensitive information via the success parameter to /user.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-47608 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Fullworks Quick Contact Form plugin <=Â 8.0.3.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25484 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Oliver SchlÃ¶be Simple Yearly Archive plugin <=Â 2.1.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25479 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Podlove Podlove Subscribe button plugin <=Â 1.3.7 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26057 ‼\n\nAn XXE issue was discovered in Nokia NetAct before 22 FP2211 via an XML document to the Configuration Dashboard page. Input validation and a proper XML parser configuration are missing. For an external attacker, it is very difficult to exploit this, because a few dynamically created parameters such as Jsession-id, a CSRF token, and an Nxsrf token would be needed. The attack can realistically only be performed by an internal user.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-27619 ‼\n\nAuth (subscriber+) Reflected Cross-Site Scripting (XSS) vulnerability in Macho Themes Regina Lite theme <=Â 2.0.7 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-45837 ‼\n\nReflected Cross-Site Scripting (XSS) vulnerability in Denis ???????? plugin <=Â 6.0.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25347 ‼\n\nA stored cross-site scripting (XSS) vulnerability in ChurchCRM 4.5.3, allows remote attackers to inject arbitrary web script or HTML via input fields. These input fields are located in the \"Title\" Input Field in EventEditor.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26058 ‼\n\nAn XXE issue was discovered in Nokia NetAct before 22 FP2211 via an XML document to a Performance Manager page. Input validation and a proper XML parser configuration are missing. For an external attacker, it is very difficult to exploit this, because a few dynamically created parameters such as Jsession-id, a CSRF token, and an Nxsrf token would be needed. The attack can realistically only be performed by an internal user.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26843 ‼\n\nA stored Cross-site scripting (XSS) vulnerability in ChurchCRM 4.5.3 allows remote attackers to inject arbitrary web script or HTML via the NoteEditor.php.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25710 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in DIGITALBLUE Click to Call or Chat Buttons plugin <=Â 1.4.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25490 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Eric Teubert Archivist â€“ Custom Archive Templates plugin <=Â 1.7.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25346 ‼\n\nA reflected cross-site scripting (XSS) vulnerability in ChurchCRM 4.5.3 allows remote attackers to inject arbitrary web script or HTML via the id parameter of /churchcrm/v2/family/not-found.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25348 ‼\n\nChurchCRM 4.5.3 was discovered to contain a CSV injection vulnerability via the Last Name and First Name input fields when creating a new person. These vulnerabilities allow attackers to execute arbitrary code via a crafted excel file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-25",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30417 ‼\n\nA cross-site scripting (XSS) vulnerability in Pear-Admin-Boot up to v2.0.2 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the Title of a private message.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-13",
    "from_channel": "aptreports",
    "message": "#ParsedReport #CompletenessLow\n12-04-2023\n\nDirty Vanity: A New Approach to Code Injection & EDR Bypass\n\nhttps://www.deepinstinct.com/blog/dirty-vanity-a-new-approach-to-code-injection-edr-bypass\n\nReport completeness: Low\n\nThreats:\nDirty_vanity_technique\nCredential_dumping_technique\nCode_cave_technique\nHook\n\nIOCs:\nFile: 6\nPath: 1\n\nSofts:\nunix, windows subsystem for linux\n\nFunctions:\nCreateInfo, NtForkUserProcess\n\nWin API:\nRtlCreateProcessReflection, RtlCloneUserProcess, NtCreateUserProcess, GetCurrentProcess, NtCreateUserProcessFunc, NtCreateProcessEx, NtCreateProcess, MmInitializeProcessAddressSpace, WriteProcessMemory, NtMapViewOfSection, have more...\n\nLinks:\nhttps://github.com/hasherezade/pe-sieve/blob/master/utils/process\\_reflection.cpp\nhttps://gist.github.com/GeneralTesler/68903f7eb00f047d32a4d6c55da5a05c\nhttps://gist.github.com/juntalis/4366916\nhttps://gist.github.com/Cr4sh/126d844c28a7fbfd25c6\nhttps://github.com/rainerzufalldererste/windows\\_x64\\_shellcode\\_template\nhttps://github.com/deepinstinct/Dirty-Vanity",
    "webpage_description": "Dirty Vanity is a new code-injection technique that abuses forking, a lesser-known mechanism that exists in Windows operating systems. In this post, we will dive deep into forking, explore its legitimate use, and show how it can be manipulated into blind-sighting EDRs by injecting malicious code.",
    "webpage_url": "https://www.deepinstinct.com/blog/dirty-vanity-a-new-approach-to-code-injection-edr-bypass"
}
{
    "date": "2023-04-13",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-2014 ‼\n\nCross-site Scripting (XSS) - Generic in GitHub repository microweber/microweber prior to 1.3.3.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-13",
    "from_channel": "Leakers_squad",
    "message": "🌀Network and Web Hacking🌀\n\n🔹Pentesting Routers\n🔹Attacking SSH with Metasploit, Nmap, Medusa, Hydra, Ncrack\n🔹SNMP attacks\n🔹Bypassing Firewalls\n🔹Payloads and Shells\n🔹HTTP/HTTPS tunneling\n🔹Port Forwaring, Pivoting, Reverse Connects\n🔹Privilege Escalation and UAC bypass\n🔹Hash Dumping and Mimikatz\n🔹Windows Sessions, Stations and Desktops\n🔹Impersonation attacks\n🔹WMIC post exploitation\n🔹Hidden bind shells\n🔹Bitsadmin by Its_me_kali\n🔹Browser Password Recovery\n🔹PAC Attacks\n🔹DNS Poisoning\n🔹Veil Framework \n🔹DLL Injection using Appinit_DLLs\n🔹Stripping Manifest Files for DLL Hijacking\n🔹Attacking with DLL Forwarding \n🔹Anti-Forensics techniques\n🔹SSL/TLS misconfigurations\n🔹Command Injection\n🔹SQL Injection\n🔹Cross-Site Scripting (XSS)\n🔹Local and Remote File Inclusion (LFI / RFI)\n🔹Cross-Site Request Forgery (CSRF)\n🔹And other interesting topics\n\n❇️Download Link :: https://bit.ly/3LywtvX\n(click on first website)\n\nContact for posting these content in your channel @Mr_Neophyte\n\nShare with Your Friends and Team✔️\n\nIf you want to report any copyright violation, please write to us at  @Leakers_squad_bot and we will ensure to remove that post within 48 hours\nRead this",
    "webpage_url": "https://telegra.ph/file/af0bc6f0c130ba91d06bb.jpg"
}
{
    "date": "2023-04-13",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26384 ‼\n\nAdobe Substance 3D Stager version 2.0.1 (and earlier) is affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-13",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26392 ‼\n\nAdobe Substance 3D Stager version 2.0.1 (and earlier) is affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-13",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-22235 ‼\n\nInCopy versions 18.1 (and earlier), 17.4 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-13",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26388 ‼\n\nAdobe Substance 3D Stager version 2.0.1 (and earlier) is affected by an Improper Input Validation vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "defcon_news",
    "message": "TikTok: Unrestricted File Upload on https://partner.tiktokshop.com/wsos_v2/oec_partner/upload\nhttps://vulners.com/hackerone/H1:1890284?utm_source=rss&utm_medium=rss&utm_campaign=rss",
    "webpage_description": "An unrestricted file upload vulnerability was found on a partner.tiktokshop.com endpoint, where if the content-type in the header was changed, any extension could be uploaded. We thank @h4x0r_dz for reporting this to our...",
    "webpage_url": "https://vulners.com/hackerone/H1:1890284?utm_source=rss&utm_medium=rss&utm_campaign=rss"
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26417 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26418 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26423 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26420 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26422 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26405 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by an Improper Input Validation vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26424 ‼\n\nAdobe Acrobat Reader versions 23.001.20093 (and earlier) and 20.005.30441 (and earlier) are affected by a Use After Free vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30520 ‼\n\nJenkins Quay.io trigger Plugin 0.1 and earlier does not limit URL schemes for repository homepage URLs submitted via Quay.io trigger webhooks, resulting in a stored cross-site scripting (XSS) vulnerability exploitable by attackers able to submit crafted Quay.io trigger webhook payloads.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "aptreports",
    "message": "#ParsedReport #CompletenessLow\n11-04-2023\n\nNokoyawa ransomware attacks with Windows zero-day\n\nhttps://securelist.com/nokoyawa-ransomware-attacks-with-windows-zero-day/109483\n\nReport completeness: Low\n\nActors/Campaigns:\nMysterysnail\n\nThreats:\nNokoyawa\nPuzzlemaker\nTrojan.win32.generic\nRansom.win32.generic\nCobalt_strike\n\nIndustry:\nEnergy, Healthcare, Retail\n\nGeo:\nAsia, America\n\nCVEs:\nCVE-2022-37969  [Vulners]\n    CVSS V3.1: 7.8, \n    Vulners: Exploitation: True\n    X-Force: Risk: 7.8\n    X-Force: Patch: Official fix\n    Soft:\n    - microsoft windows 10 (-, 1607, 1809, 20h2, 21h1, 21h2)\n    - microsoft windows server 2008 (r2, -)\n    - microsoft windows 7 (-)\n    - microsoft windows server 2012 (r2, -)\n    - microsoft windows server 2016 (-)\n    have more...\nCVE-2022-24521  [Vulners]\n    CVSS V3.1: 7.8, \n    Vulners: Exploitation: True\n    X-Force: Risk: 7.8\n    X-Force: Patch: Official fix\n    Soft:\n    - microsoft windows server 2008 (r2, *)\n    - microsoft windows server 2012 (r2, -)\n    - microsoft windows 10 (1607, -, 1809, 1909, 20h2, 21h1, 21h2)\n    - microsoft windows 8.1 (-)\n    - microsoft windows server 2016 (-, 20h2)\n    have more...\nCVE-2023-23376  [Vulners]\n    CVSS V3.1: 7.8, \n    Vulners: Exploitation: True\n    X-Force: Risk: 7.8\n    X-Force: Patch: Official fix\n    Soft:\n    - microsoft windows server 2008 (r2, -)\n    - microsoft windows server 2012 (r2, -)\n    - microsoft windows server 2016 (-)\n    - microsoft windows server 2019 (-)\n    - microsoft windows server 2022 (-)\n    have more...\nCVE-2023-28252  [Vulners]\n    CVSS V3.1: Unknown, \n    Vulners: Exploitation: True\n    X-Force: Risk: Unknown\n    X-Force: Patch: Unknown\n\n\nIOCs:\nFile: 1\nPath: 4\nHash: 5\nDomain: 4\n\nSofts:\nwindows common log file system driver\n\nWin API:\nCreateLogFile, AddLogContainer, AddLogContainerSet, NtQuerySystemInformation\n\nLinks:\nhttps://github.com/ionescu007/clfs-docs",
    "webpage_description": "In February 2023, we found a zero-day exploit, supporting different versions and builds of Windows, including Windows 11. This particular zero-day was used by a sophisticated cybercrime group that carries out ransomware attacks.",
    "webpage_url": "https://securelist.com/nokoyawa-ransomware-attacks-with-windows-zero-day/109483/"
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1872 ‼\n\nA use-after-free vulnerability in the Linux Kernel io_uring system can be exploited to achieve local privilege escalation. The io_file_get_fixed function lacks the presence of ctx->uring_lock which can lead to a Use-After-Free vulnerability due a race condition with fixed files getting unregistered. We recommend upgrading past commit da24142b1ef9fd5d36b76e36bab328a5b27523e8.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1829 ‼\n\nA use-after-free vulnerability in the Linux Kernel traffic control index filter (tcindex) can be exploited to achieve local privilege escalation.Â The tcindex_delete function which does not properly deactivate filters in case of a perfect hashes while deleting the underlying structure which can later lead to double freeing the structure.Â A local attacker user can use this vulnerability to elevate its privileges to root. We recommend upgrading past commit 8c710f75256bb3cf05ac7b1672c82b92c43f3d28.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-12",
    "from_channel": "cibsecurity",
    "message": "♟️ Microsoft (& Apple) Patch Tuesday, April 2023 Edition ♟️\n\nMicrosoft today released software updates to plug 100 security holes in its Windows operating systems and other software, including a zero-day vulnerability that is already being used in active attacks. Not to be outdone, Apple has released a set of important updates addressing two zero-day vulnerabilities that are being used to attack iPhones, iPads and Macs.\n\n📖 Read\n\nvia \"Krebs on Security\".",
    "webpage_description": "Microsoft today released software updates to plug 100 security holes in its Windows operating systems and other software, including a zero-day vulnerability that is already being used in active attacks. Not to be outdone, Apple has released a set of…",
    "webpage_url": "https://krebsonsecurity.com/2023/04/microsoft-apple-patch-tuesday-april-2023-edition/"
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28228 ‼\n\nWindows Spoofing Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28311 ‼\n\nMicrosoft Word Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23375 ‼\n\nMicrosoft ODBC and OLE DB Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28243 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28237 ‼\n\nWindows Kernel Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28299 ‼\n\nVisual Studio Spoofing Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28255 ‼\n\nWindows DNS Server Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28304 ‼\n\nMicrosoft ODBC and OLE DB Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28278 ‼\n\nWindows DNS Server Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24927 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28296 ‼\n\nVisual Studio Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24924 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24886 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24885 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24884 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-21727 ‼\n\nRemote Procedure Call Runtime Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28219 ‼\n\nLayer 2 Tunneling Protocol Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24925 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24893 ‼\n\nVisual Studio Code Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24887 ‼\n\nMicrosoft PostScript and PCL6 Class Printer Driver Remote Code Execution Vulnerability\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1986 ‼\n\nA vulnerability, which was classified as critical, was found in SourceCodester Online Computer and Laptop Store 1.0. Affected is the function delete_order of the file /classes/master.php?f=delete_order. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-225534 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1987 ‼\n\nA vulnerability has been found in SourceCodester Online Computer and Laptop Store 1.0 and classified as critical. Affected by this vulnerability is the function update_order_status of the file /classes/Master.php?f=update_order_status. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-225535.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1984 ‼\n\nA vulnerability classified as critical was found in SourceCodester Complaint Management System 1.0. This vulnerability affects unknown code of the file /users/check_availability.php of the component POST Parameter Handler. The manipulation of the argument email leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-225532.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1985 ‼\n\nA vulnerability, which was classified as critical, has been found in SourceCodester Online Computer and Laptop Store 1.0. This issue affects the function save_brand of the file /classes/Master.php?f=save_brand. The manipulation of the argument name leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-225533 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-22642 ‼\n\nAn improper certificate validation vulnerability [CWE-295] in FortiAnalyzer and FortiManager 7.2.0 through 7.2.1, 7.0.0 through 7.0.5, 6.4.8 through 6.4.10 may allow a remote and unauthenticated attacker to perform a Man-in-the-Middle attack on the communication channel between the device and the remote FortiGuard server hosting outbreakalert ressources.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-41331 ‼\n\nA missing authentication for critical function vulnerability [CWE-306] in FortiPresence infrastructure server before version 1.2.1 allows a remote, unauthenticated attacker to access the Redis and MongoDB instances via crafted authentication requests.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-41330 ‼\n\nAn improper neutralization of input during web page generation vulnerability ('Cross-site Scripting') [CWE-79] in Fortinet FortiOS version 7.2.0 through 7.2.3, version 7.0.0 through 7.0.9, version 6.4.0 through 6.4.11 and before 6.2.12 and FortiProxy version 7.2.0 through 7.2.1 and before 7.0.7 allows an unauthenticated attacker to perform an XSS attack via crafted HTTP GET requests.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1983 ‼\n\nA vulnerability was found in SourceCodester Sales Tracker Management System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /admin/products/manage_product.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-225530 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-42477 ‼\n\nAn improper input validation vulnerability [CWE-20] in FortiAnalyzer version 7.2.1 and below, version 7.0.6 and below, 6.4 all versions may allow an authenticated attacker to disclose file system information via custom dataset SQL queries.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-43955 ‼\n\nAn improper neutralization of input during web page generation [CWE-79] in the FortiWeb web interface 7.0.0 through 7.0.3, 6.3.0 through 6.3.21, 6.4 all versions, 6.2 all versions, 6.1 all versions and 6.0 all versions may allow an unauthenticated and remote attacker to perform a reflected cross site scripting attack (XSS) via injecting malicious payload in log entries used to build report.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-43951 ‼\n\nAn exposure of sensitive information to an unauthorized actor vulnerability [CWE-200] in FortiNAC 9.4.1 and below, 9.2.6 and below, 9.1.8 and below, 8.8.11 and below, 8.7.6 and below may allow an unauthenticated attacker to access sensitive information via crafted HTTP requests.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-35850 ‼\n\nAn improper neutralization of script-related HTML tags in a web page vulnerability [CWE-80] in FortiAuthenticator versions 6.4.0 through 6.4.4, 6.3.0 through 6.3.3, all versions of 6.2 and 6.1 may allow a remote unauthenticated attacker to trigger a reflected cross site scripting (XSS) attack via the \"reset-password\" page.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-42470 ‼\n\nA relative path traversal vulnerability in Fortinet FortiClient (Windows) 7.0.0 - 7.0.7, 6.4.0 - 6.4.9, 6.2.0 - 6.2.9 and 6.0.0 - 6.0.10 allows an attacker to execute unauthorized code or commands via sending a crafted request to a specific named pipe.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26847 ‼\n\nA stored cross-site scripting (XSS) vulnerability in OpenCATS v0.9.7 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the state parameter at opencats/index.php?m=candidates.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26846 ‼\n\nA stored cross-site scripting (XSS) vulnerability in OpenCATS v0.9.7 allows attackers to execute arbitrary web scripts or HTML via a crafted payload injected into the city parameter at opencats/index.php?m=candidates.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-30465 ‼\n\nImproper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Apache Software Foundation Apache InLong.This issue affects Apache InLong: from 1.4.0 through 1.5.0.Â By manipulating the \"orderType\" parameter and the ordering of the returned content using an SQL injection attack, an attacker can extract the username of theÂ Â  user with ID 1 from the \"user\" table, one character at a time.Â  Users are advised to upgrade to Apache InLong's 1.6.0 or cherry-pick [1] to solve it. https://programmer.help/blogs/jdbc-deserialization-vulnerability-learning.html [1] https://github.com/apache/inlong/issues/7529 https://github.com/apache/inlong/issues/7529\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23277 ‼\n\nSnippet-box 1.0.0 is vulnerable to Cross Site Scripting (XSS). Remote attackers can render arbitrary web script or HTML from the \"Snippet code\" form field.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "freedomf0x",
    "message": "GodPotato. Windows LPE:\n* Windows Server 2012 - Windows Server 2022 ;\n* Windows8 - Windows 11\n\nhttps://github.com/BeichenDream/GodPotato\n\n#poc #lpe"
}
{
    "date": "2023-04-11",
    "from_channel": "RalfHackerChannel",
    "message": "В семействе картошек пополнение - GodPotato. Windows LPE:\n* Windows Server 2012 - Windows Server 2022 ;\n* Windows8 - Windows 11\n\nhttps://github.com/BeichenDream/GodPotato\n\n#git #soft #lpe",
    "webpage_description": "Contribute to BeichenDream/GodPotato development by creating an account on GitHub.",
    "webpage_url": "https://github.com/BeichenDream/GodPotato"
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28828 ‼\n\nA vulnerability has been identified in Polarion ALM (All versions < V2304.0). The application contains a XML External Entity Injection (XXE) vulnerability. This could allow an attacker to view files on the application server filesystem.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26293 ‼\n\nA vulnerability has been identified in TIA Portal V15 (All versions), TIA Portal V16 (All versions), TIA Portal V17 (All versions), TIA Portal V18 (All versions < V18 Update 1). Affected products contain a path traversal vulnerability that could allow the creation or overwrite of arbitrary files in the engineering system. If the user is tricked to open a malicious PC system configuration file, an attacker could exploit this vulnerability to achieve arbitrary code execution.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28340 ‼\n\nZoho ManageEngine Applications Manager through 16320 allows the admin user to conduct an XXE attack.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28341 ‼\n\nStored Cross site scripting (XSS) vulnerability in Zoho ManageEngine Applications Manager through 16340 allows an unauthenticated user to inject malicious javascript on the incorrect login details page.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28761 ‼\n\nInÂ SAP NetWeaver Enterprise Portal - version 7.50,Â an unauthenticated attacker can attach to an open interface and make use of an open API to access a service which will enable them to access or modify server settings and data, leading to limited impact on confidentiality and integrity.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-11",
    "from_channel": "Leakers_squad",
    "message": "Top 9 eBooks 💻\n#Books\n\n💻 Hacking Web Applications - Hacking Exposed\n💻 Hacking for Dummies \n💻 Network Security Bible \n💻 Reversing - Secrets of Reverse Engineering \n💻 Ethical Hacking and Countermeasures \n💻 The Little Black Book of Computer Viruses \n💻 XSS Attacks - Cross Site Scripting Exploits and Defense \n💻 The Shellcoder's Handbook \n💻 Wireshark for Security Professionals \n\n🔗Link : https://bit.ly/3LywtvX\n(click on first website)\n\nContact for posting these content in your channel @Mr_Neophyte\n\nShare with Your Friends and Team✔️\n\nIf you want to report any copyright violation, please write to us at  @Leakers_squad_bot and we will ensure to remove that post within 48 hours\nRead this"
}
{
    "date": "2023-04-11",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24721 ‼\n\nA cross-site scripting (XSS) vulnerability in LiveAction LiveSP v21.1.2 allows attackers to execute arbitrary web scripts or HTML.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2015-10100 ‼\n\nA vulnerability, which was classified as critical, has been found in Dynamic Widgets Plugin up to 1.5.10. This issue affects some unknown processing of the file classes/dynwid_class.php. The manipulation leads to sql injection. The attack may be initiated remotely. Upgrading to version 1.5.11 is able to address this issue. The name of the patch is d0a19c6efcdc86d7093b369bc9e29a0629e57795. It is recommended to upgrade the affected component. The identifier VDB-225353 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1969 ‼\n\nA vulnerability classified as critical was found in SourceCodester Online Eyewear Shop 1.0. This vulnerability affects unknown code of the file /admin/inventory/manage_stock.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-225406 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1971 ‼\n\n** UNSUPPPORTED WHEN ASSIGNED ** ** UNSUPPORTED WHEN ASSIGNED ** A vulnerability, which was classified as critical, was found in yuan1994 tpAdmin 1.3.12. Affected is the function remote of the file application\\admin\\controller\\Upload.php. The manipulation of the argument url leads to server-side request forgery. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-225408. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "defcon_news",
    "message": "ChurchCRM 4.5.1 SQL Injection\nhttps://packetstormsecurity.com/files/171805/churchcrm451-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171805/churchcrm451-sql.txt"
}
{
    "date": "2023-04-10",
    "from_channel": "defcon_news",
    "message": "NotrinosERP 0.7 SQL Injection\nhttps://packetstormsecurity.com/files/171804/notrinoserp07-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171804/notrinoserp07-sql.txt"
}
{
    "date": "2023-04-10",
    "from_channel": "defcon_news",
    "message": "Medicine Tracker System 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/171780/mts10-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171780/mts10-sql.txt"
}
{
    "date": "2023-04-10",
    "from_channel": "defcon_news",
    "message": "Restaurant Management System 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/171776/rms10-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171776/rms10-sql.txt"
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24181 ‼\n\nLuCI openwrt-22.03 branch git-22.361.69894-438c598 was discovered to contain a reflected cross-site scripting (XSS) vulnerability via the component /openvpn/pageswitch.htm.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1425 ‼\n\nThe WordPress CRM, Email & Marketing Automation for WordPress | Award Winner â€” Groundhogg WordPress plugin before 2.7.9.4 does not properly sanitise and escape a parameter before using it in a SQL statement, leading to a SQL injection exploitable by high privilege users such as admins\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1406 ‼\n\nThe JetEngine WordPress plugin before 3.1.3.1 includes uploaded files without adequately ensuring that they are not executable, leading to a remote code execution vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29376 ‼\n\nAn issue was discovered in Progress Sitefinity 13.3 before 13.3.7647, 14.0 before 14.0.7736, 14.1 before 14.1.7826, 14.2 before 14.2.7930, and 14.3 before 14.3.8025. There is potential XSS by privileged users in Sitefinity to media libraries.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1478 ‼\n\nThe Hummingbird WordPress plugin before 3.4.2 does not validate the generated file path for page cache files before writing them, leading to a path traversal vulnerability in the page cache module.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-39048 ‼\n\nServiceNow Tokyo allows XSS.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2015-10099 ‼\n\nA vulnerability classified as critical has been found in CP Appointment Calendar Plugin up to 1.1.5. This affects the function dex_process_ready_to_go_appointment of the file dex_appointments.php. The manipulation of the argument itemnumber leads to sql injection. It is possible to initiate the attack remotely. The name of the patch is e29a9cdbcb0f37d887dd302a05b9e8bf213da01d. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-225351.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36077 ‼\n\nSQL injection vulnerability found in Tailor Mangement System v.1 allows a remote attacker to execute arbitrary code via the customer parameter of the orderadd.php file\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26860 ‼\n\nSQL injection vulnerability found in PrestaShop Igbudget v.1.0.3 and before allow a remote attacker to gain privileges via the LgBudgetBudgetModuleFrontController::displayAjaxGenerateBudget component.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-27603 ‼\n\nIn Apache Linkis <=1.3.1, due to the Manager module engineConn material upload does not check the zip path,Â This is a Zip Slip issue, which will lead to aÂ potential RCE vulnerability. We recommend users upgrade the version of Linkis to version 1.3.2.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-09",
    "from_channel": "cibsecurity",
    "message": "📢 The GoAnywhere data breach explained 📢\n\nHow a zero-day vulnerability in Fortra’s GoAnywhere MFT product led to an array of high-profile cyber attacks around the world\n\n📖 Read\n\nvia \"ITPro\".",
    "webpage_description": "How a zero-day vulnerability in Fortra’s GoAnywhere MFT product led to an array of high-profile cyber attacks around the world",
    "webpage_url": "https://www.itpro.co.uk/security/data-breaches/370409/the-goanywhere-data-breach-explained"
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1953 ‼\n\nA vulnerability was found in SourceCodester Online Computer and Laptop Store 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /admin/sales/index.php. The manipulation of the argument date_start/date_end leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-225340.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1958 ‼\n\nA vulnerability, which was classified as critical, was found in SourceCodester Online Computer and Laptop Store 1.0. This affects an unknown part of the file /classes/Master.php?f=delete_sub_category. The manipulation of the argument id leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-225345 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1955 ‼\n\nA vulnerability classified as critical has been found in SourceCodester Online Computer and Laptop Store 1.0. Affected is an unknown function of the file login.php of the component User Registration. The manipulation of the argument email leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-225342 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1959 ‼\n\nA vulnerability has been found in SourceCodester Online Computer and Laptop Store 1.0 and classified as critical. This vulnerability affects unknown code of the file /classes/Master.php?f=save_category. The manipulation of the argument category leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-225346 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1954 ‼\n\nA vulnerability was found in SourceCodester Online Computer and Laptop Store 1.0. It has been rated as critical. This issue affects the function save_inventory of the file /admin/product/manage.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-225341 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-08",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1957 ‼\n\nA vulnerability, which was classified as critical, has been found in SourceCodester Online Computer and Laptop Store 1.0. Affected by this issue is some unknown functionality of the file /classes/Master.php?f=save_sub_category of the component Subcategory Handler. The manipulation of the argument sub_category leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-225344.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-27033 ‼\n\nPrestashop cdesigner v3.1.3 to v3.1.8 was discovered to contain a code injection vulnerability via the component CdesignerSaverotateModuleFrontController::initContent().\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1941 ‼\n\nA vulnerability, which was classified as critical, has been found in SourceCodester Simple and Beautiful Shopping Cart System 1.0. This issue affects some unknown processing of the file login.php. The manipulation of the argument username/password leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-225317 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1940 ‼\n\nA vulnerability classified as critical was found in SourceCodester Simple and Beautiful Shopping Cart System 1.0. This vulnerability affects unknown code of the file delete_user_query.php. The manipulation of the argument user_id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-225316.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1909 ‼\n\nA vulnerability, which was classified as critical, was found in PHPGurukul BP Monitoring Management System 1.0. Affected is an unknown function of the file profile.php of the component User Profile Update Handler. The manipulation of the argument name/mobno leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-225318 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28710 ‼\n\nImproper Input Validation vulnerability in Apache Software Foundation Apache Airflow Spark Provider.This issue affects Apache Airflow Spark Provider: before 4.0.1.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28781 ‼\n\nUnauth. Stored Cross-Site Scripting (XSS) vulnerability in Cimatti Consulting WordPress Contact Forms by Cimatti plugin <= 1.5.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25442 ‼\n\nAuth. (admin+) Stored Cross-site Scripting (XSS) vulnerability in Marcel Pol Zeno Font Resizer plugin <= 1.7.9 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28789 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in Cimatti Consulting WordPress Contact Forms by Cimatti plugin <= 1.5.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28707 ‼\n\nImproper Input Validation vulnerability in Apache Software Foundation Apache Airflow Drill Provider.This issue affects Apache Airflow Drill Provider: before 2.3.2.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29170 ‼\n\nAuth. (admin+) Stored Cross-site Scripting (XSS) vulnerability in PI Websolution Product Enquiry for WooCommerce, WooCommerce product catalog plugin <= 2.2.12 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29172 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in PropertyHive plugin <= 1.5.46 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28706 ‼\n\nImproper Control of Generation of Code ('Code Injection') vulnerability in Apache Software Foundation Apache Airflow Hive Provider.This issue affects Apache Airflow Hive Provider: before 6.0.0.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-27620 ‼\n\nAuth. (contributor+) Stored Cross-site Scripting (XSS) vulnerability in RoboSoft Photo Gallery, Images, Slider in Rbs Image Gallery plugin <= 3.2.12 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23799 ‼\n\nAuth. (admin+) Stored Cross-site Scripting (XSS) vulnerability in Leonardo Giacone Easy Panorama plugin <= 1.1.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-10",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29388 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in impleCode Product Catalog Simple plugin <= 1.6.17 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23994 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Marcel Bootsman Auto Hide Admin Bar plugin <= 1.6.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25464 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in StreamWeasels Twitch Player plugin <= 2.1.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25702 ‼\n\nAuth. (admin+) Stored Cross-site Scripting (XSS) vulnerability in Fullworks Quick Paypal Payments plugin <= 5.7.25 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28993 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in Ignazio Scimone Albo Pretorio On Line plugin <= 4.6.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25049 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in impleCode eCommerce Product Catalog Plugin for WordPress plugin <= 3.3.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25711 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in WPGlobus WPGlobus Translate Options plugin <= 2.1.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25020 ‼\n\nUnauth. Stored Cross-Site Scripting (XSS) vulnerability in Kiboko Labs Arigato Autoresponder and Newsletter plugin <= 2.7.1.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25031 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Kiboko Labs Arigato Autoresponder and Newsletter plugin <= 2.7.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25716 ‼\n\nAuth (admin+) Stored Cross-Site Scripting (XSS) vulnerability in gqevu6bsiz Announce from the Dashboard plugin <= 1.5.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1726 ‼\n\nImproper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Proliz OBS allows Stored XSS for an authenticated user.This issue affects OBS: before 23.04.01.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29094 ‼\n\nAuth. (admin+) Stored Cross-site Scripting (XSS) vulnerability in PI Websolution Product page shipping calculator for WooCommerce plugin <= 1.3.20 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25041 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in Cththemes Monolit theme <= 2.0.6 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25713 ‼\n\nUnauth. Stored Cross-Site Scripting (XSS) vulnerability in Fullworks Quick Paypal Payments plugin <= 5.7.25 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23885 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Fullworks Quick Contact Form plugin <= 8.0.3.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25712 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in WP-Buddy Google Analytics Opt-Out plugin <= 2.3.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25705 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Go Prayer WP Prayer plugin <= 1.9.6 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29236 ‼\n\nUnauth. Reflected Cross-Site Scripting (XSS) vulnerability in Cththemes Outdoor theme <= 3.9.6 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25059 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in avalex GmbH avalex â€“ Automatically secure legal texts plugin <= 3.0.3 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24402 ‼\n\nAuth. (admin+) Cross-Site Scripting (XSS) vulnerability in Veribo, Roland Murg WP Booking System â€“ Booking Calendar plugin <= 2.0.18 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25061 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Kiboko Labs Arigato Autoresponder and Newsletter plugin <= 2.7.1.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26820 ‼\n\nsiteproxy v1.0 was discovered to contain a path traversal vulnerability via the component index.js.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29474 ‼\n\ninventory in Atos Unify OpenScape 4000 Platform and OpenScape 4000 Manager Platform 10 R1 before 10 R1.34.4 allows an unauthenticated attacker to run arbitrary commands on the platform operating system and achieve administrative access, aka OSFOURK-23552.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29473 ‼\n\nwebservice in Atos Unify OpenScape 4000 Platform and OpenScape 4000 Manager Platform 10 R1 before 10 R1.34.4 allows an unauthenticated attacker to run arbitrary commands on the platform operating system and achieve administrative access, aka OSFOURK-23710.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29475 ‼\n\ninventory in Atos Unify OpenScape 4000 Platform and OpenScape 4000 Manager Platform 10 R1 before 10 R1.34.4 allows an unauthenticated attacker to run arbitrary commands on the platform operating system and achieve administrative access, aka OSFOURK-23543.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20680 ‼\n\nIn adsp, there is a possible out of bounds write due to improper input validation. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS07664785; Issue ID: ALPS07664785.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20681 ‼\n\nIn adsp, there is a possible out of bounds write due to improper input validation. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation. Patch ID: ALPS07696134; Issue ID: ALPS07696134.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26083 ‼\n\nMemory leak vulnerability in Mali GPU Kernel Driver in Midgard GPU Kernel Driver all versions from r6p0 - r32p0, Bifrost GPU Kernel Driver all versions from r0p0 - r42p0, Valhall GPU Kernel Driver all versions from r19p0 - r42p0, and Avalon GPU Kernel Driver all versions from r41p0 - r42p0 allows a non-privileged user to make valid GPU processing operations that expose sensitive kernel metadata.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-29010 ‼\n\nBudibase is a low code platform for creating internal tools, workflows, and admin panels. Versions prior to 2.4.3 (07 March 2023) are vulnerable to Server-Side Request Forgery. This can lead to an attacker gaining access to a Budibase AWS secret key. Users of Budibase cloud need to take no action. Self-host users who run Budibase on the public internet and are using a cloud provider that allows HTTP access to metadata information should ensure that when they deploy Budibase live, their internal metadata endpoint is not exposed.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36072 ‼\n\nSQL injection vulnerability found in Tailor Management System v.1 allows a remote attacker to execute arbitrary code via the id parameter.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-22985 ‼\n\nSourcecodester Simple Guestbook Management System version 1 is vulnerable to Cross Site Scripting (XSS) via Name, Referrer, Location, and Comments.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24378 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Codeat Glossary plugin <= 2.1.27 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25062 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in PINPOINT.WORLD Pinpoint Booking System plugin <= 2.9.9.2.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24374 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Photon WP Material Design Icons for Page Builders plugin <= 1.4.2 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36073 ‼\n\nSQL injection vulnerability found in Tailor Management System v.1 allows a remote attacker to execute arbitrary code via the detail parameter of the document.php page.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23891 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in OceanWP Ocean Extra plugin <= 2.1.1 versions. Needs the OceanWP theme installed and activated.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36071 ‼\n\nSQL injection vulnerability found in Tailor Management System v.1 allows a remote authenticated attacker to execute arbitrary code via the customer parameter of the email.php page.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36074 ‼\n\nSQL injection vulnerability found in Tailor Mangement System v.1 allows a remote attacker to execute arbitrary code via the title parameter.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24396 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in E4J s.R.L. VikBooking Hotel Booking Engine & PMS plugin <= 1.5.11 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "defcon_news",
    "message": "Mitel MiCollab AWV 8.1.2.4 / 9.1.3 Directory Traversal / LFI\nhttps://packetstormsecurity.com/files/171751/mma913-traversallfi.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171751/mma913-traversallfi.txt"
}
{
    "date": "2023-04-06",
    "from_channel": "defcon_news",
    "message": "Intern Record System 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/171740/internrs10-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171740/internrs10-sql.txt"
}
{
    "date": "2023-04-06",
    "from_channel": "defcon_news",
    "message": "Simple Task Managing System 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/171739/stms10-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171739/stms10-sql.txt"
}
{
    "date": "2023-04-06",
    "from_channel": "defcon_news",
    "message": "Provide Server 14.4 XSS / Cross Site Request Forgery / Code Execution\nhttps://packetstormsecurity.com/files/171734/provideserver144-xssxsrfexec.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171734/provideserver144-xssxsrfexec.txt"
}
{
    "date": "2023-04-06",
    "from_channel": "defcon_news",
    "message": "itech TrainSmart r1044 SQL Injection\nhttps://packetstormsecurity.com/files/171731/trainsmart1044-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171731/trainsmart1044-sql.txt"
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1908 ‼\n\nA vulnerability was found in SourceCodester Simple Mobile Comparison Website 1.0. It has been classified as critical. Affected is an unknown function of the file /admin/categories/view_category.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-225150 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23980 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in MailOptin Popup Builder Team MailOptin plugin <= 1.2.54.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23987 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in WPEverest User Registration plugin <= 2.3.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24002 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in WPdevart YouTube Embed, Playlist and Popup by WpDevArt plugin <= 2.6.3 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24001 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Yannick Lefebvre Modal Dialog plugin <= 3.5.9 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23971 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in CodePeople WP Time Slots Booking Form plugin <= 1.1.81 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23815 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Alan Jackson Multi-column Tag Map plugin <= 17.0.24 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24006 ‼\n\nAuth. (admin+) Cross-Site Scripting (XSS) vulnerability in Link Software LLC WP Terms Popup plugin <= 2.6.0 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23979 ‼\n\nUnauth. Stored Cross-Site Scripting (XSS) vulnerability in Fullworks Quick Event Manager plugin <= 9.7.4 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24003 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Timersys WP Popups â€“ WordPress Popup plugin <= 2.1.4.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23982 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in WPGear.Pro WPFrom Email plugin <= 1.8.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23981 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in QuantumCloud Conversational Forms for ChatBot plugin <= 1.1.6 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-07",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-31889 ‼\n\nCross Site Scripting (XSS) vulnerability in audit/templates/auditlogs.tmpl.php in osTicket osTicket-plugins before commit a7842d494889fd5533d13deb3c6a7789768795ae.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-0523 ‼\n\nAn issue has been discovered in GitLab affecting all versions starting from 15.6 before 15.8.5, 15.9 before 15.9.4, and 15.10 before 15.10.1. An XSS was possible via a malicious email address for certain instances.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-3513 ‼\n\nAn issue has been discovered in GitLab affecting all versions starting from 12.8 before 15.8.5, all versions starting from 15.9 before 15.9.4, all versions starting from 15.10 before 15.10.1. A specially crafted payload could lead to a reflected XSS on the client side which allows attackers to perform arbitrary actions on behalf of victims on self-hosted instances running without strict CSP.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24747 ‼\n\nJfinal CMS v5.1 was discovered to contain a cross-site scripting (XSS) vulnerability via the component /system/dict/list.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20145 ‼\n\nMultiple vulnerabilities in the web-based management interface of Cisco Small Business RV016, RV042, RV042G, RV082, RV320, and RV325 Routers could allow an unauthenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface. These vulnerabilities are due to insufficient input validation by the web-based management interface. An attacker could exploit these vulnerabilities by sending crafted HTTP requests to an affected device and then persuading a user to visit specific web pages that include malicious payloads. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. Cisco has not released software updates that address these vulnerabilities.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1522 ‼\n\nSQL Injection in the Hardware Inventory report of Security Center 5.11.2.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20134 ‼\n\nMultiple vulnerabilities in the web interface of Cisco Webex Meetings could allow an authenticated, remote attacker to conduct a stored cross-site scripting (XSS) attack or upload arbitrary files as recordings. For more information about these vulnerabilities, see the Details section of this advisory.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20151 ‼\n\nMultiple vulnerabilities in the web-based management interface of Cisco Small Business RV016, RV042, RV042G, RV082, RV320, and RV325 Routers could allow an unauthenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface. These vulnerabilities are due to insufficient input validation by the web-based management interface. An attacker could exploit these vulnerabilities by sending crafted HTTP requests to an affected device and then persuading a user to visit specific web pages that include malicious payloads. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. Cisco has not released software updates that address these vulnerabilities.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20143 ‼\n\nMultiple vulnerabilities in the web-based management interface of Cisco Small Business RV016, RV042, RV042G, RV082, RV320, and RV325 Routers could allow an unauthenticated, remote attacker to conduct cross-site scripting (XSS) attacks against a user of the interface. These vulnerabilities are due to insufficient input validation by the web-based management interface. An attacker could exploit these vulnerabilities by sending crafted HTTP requests to an affected device and then persuading a user to visit specific web pages that include malicious payloads. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or access sensitive, browser-based information. Cisco has not released software updates that address these vulnerabilities.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1879 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository thorsten/phpmyfaq prior to 3.1.12.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1880 ‼\n\nCross-site Scripting (XSS) - Reflected in GitHub repository thorsten/phpmyfaq prior to 3.1.12.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20068 ‼\n\nA vulnerability in the web-based management interface of Cisco Prime Infrastructure Software could allow an unauthenticated, remote attacker to conduct a reflected cross-site scripting (XSS) attack against a user of the interface on an affected device. This vulnerability is due to insufficient validation of user-supplied input. An attacker could exploit this vulnerability by persuading a user of the web-based management interface on an affected device to click a crafted link. A successful exploit could allow the attacker to execute arbitrary script code in the context of the affected interface or to access sensitive, browser-based information.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-43664 ‼\n\nA use-after-free vulnerability exists within the way Ichitaro Word Processor 2022, version 1.0.1.57600, processes protected documents. A specially crafted document can trigger reuse of freed memory, which can lead to further memory corruption and potentially result in arbitrary code execution. An attacker can provide a malicious document to trigger this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28633 ‼\n\nGLPI is a free asset and IT management software package. Starting in version 0.84 and prior to versions 9.5.13 and 10.0.7, usage of RSS feeds is subject to server-side request forgery (SSRF). In case the remote address is not a valid RSS feed, an RSS autodiscovery feature is triggered. This feature does not check safety or URLs. Versions 9.5.13 and 10.0.7 contain a patch for this issue.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-20030 ‼\n\nA vulnerability in the web-based management interface of Cisco Identity Services Engine (ISE) could allow an authenticated, remote attacker to access sensitive information, conduct a server-side request forgery (SSRF) attack through an affected device, or negatively impact the responsiveness of the web-based management interface itself. This vulnerability is due to improper handling of XML External Entity (XXE) entries when parsing certain XML files. An attacker could exploit this vulnerability by uploading a crafted XML file that contains references to external entities. A successful exploit could allow the attacker to retrieve files from the local system, resulting in the disclosure of confidential information. A successful exploit could also cause the web application to perform arbitrary HTTP requests on behalf of the attacker or consume memory resources to reduce the availability of the web-based management interface. To successfully exploit this vulnerability, an attacker would need valid Super Admin or Policy Admin credentials.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1884 ‼\n\nCross-site Scripting (XSS) - Generic in GitHub repository thorsten/phpmyfaq prior to 3.1.12.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1878 ‼\n\nCross-site Scripting (XSS) - Stored in GitHub repository thorsten/phpmyfaq prior to 3.1.12.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1882 ‼\n\nCross-site Scripting (XSS) - DOM in GitHub repository thorsten/phpmyfaq prior to 3.1.12.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-25330 ‼\n\nA SQL injection vulnerability in Mybatis plus below 3.5.3.1 allows remote attackers to execute arbitrary SQL commands via the tenant ID valuer.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26856 ‼\n\nDynamic Transaction Queuing System v1.0 was discovered to contain a SQL injection vulnerability via the name parameter at /admin/ajax.php?action=login.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26789 ‼\n\nVeritas NetBackUp OpsCenter Version 9.1.0.1 is vulnerable to Reflected Cross-site scripting (XSS). The Web App fails to adequately sanitize special characters. By leveraging this issue, an attacker is able to cause arbitrary HTML and JavaScript code to be executed in a user's browser.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1845 ‼\n\nA vulnerability, which was classified as critical, was found in SourceCodester Online Payroll System 1.0. This affects an unknown part of the file /admin/employee_row.php. The manipulation of the argument id leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-224985 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1848 ‼\n\nA vulnerability was found in SourceCodester Online Payroll System 1.0. It has been classified as critical. Affected is an unknown function of the file /admin/attendance_row.php. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-224988.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26536 ‼\n\nAuth. (contributor+) Cross-Site Scripting (XSS) vulnerability in Jonk @ Follow me Darling Sp*tify Play Button for WordPress plugin <= 2.05 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1849 ‼\n\nA vulnerability was found in SourceCodester Online Payroll System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /admin/cashadvance_row.php. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-224989 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1856 ‼\n\nA vulnerability has been found in SourceCodester Air Cargo Management System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /admin/transactions/track_shipment.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-224995.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1850 ‼\n\nA vulnerability was found in SourceCodester Online Payroll System 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /admin/login.php. The manipulation of the argument username leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-224990 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1846 ‼\n\nA vulnerability has been found in SourceCodester Online Payroll System 1.0 and classified as critical. This vulnerability affects unknown code of the file /admin/deduction_row.php. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-224986 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1847 ‼\n\nA vulnerability was found in SourceCodester Online Payroll System 1.0 and classified as critical. This issue affects some unknown processing of the file attendance.php. The manipulation of the argument employee leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-224987.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-05",
    "from_channel": "Leakers_squad",
    "message": "☠️ About Penetration Testing ☠️\n\nPenetration testing is also known as pen testing or ethical hacking. It describes the intentional launching of simulated cyberattacks that seek out exploitable vulnerabilities in computer systems, networks, websites, and applications\n\n❤️‍🔥Following are the important modules of pentesting −\n⬛️Black Box Penetration Testing\n⬜️White Box Penetration Testing\n🔲Grey Box Penetration Testing\n❤️‍🔥Types \n🍎External Network Penetration Testing. \n🍎Internal Network Penetration Testing.\n🍎Social Engineering Testing. \n🍎Physical Penetration Testing. \n🍎Wireless Penetration Testing. \n🍎Application Penetration Testing.\n\n❤️‍🔥Basic Course \n🔗Link : https://bit.ly/3LywtvX\n(click on first website)\n\nADDED✔️\n❤️‍🔥Pentest Handbook: SQL Injection To Shell Uploading \n🟢Pentesting Lab Preparation \n📋Pentesting Tools \n\nContact for posting these content in your channel @Mr_Neophyte\n\nShare with Your Friends and Team✔️"
}
{
    "date": "2023-04-04",
    "from_channel": "aptreports",
    "message": "#ParsedReport #ChatGPT #Translated\nАвтотекст: (RSTReportsAnalyser + ChatGPT + Google Translate|DeepL)\n\n------\nОсновная идея: Rilide - это вредоносное расширение для браузера, замаскированное под легитимное расширение Google Drive, способное выполнять такие вредоносные действия, как мониторинг истории просмотров, создание скриншотов и кража средств с различных криптовалютных бирж. Он был распространен с помощью двух кампаний и является ярким примером растущей сложности вредоносных расширений для браузеров.\n-----\n\nКомпания Trustwave SpiderLabs недавно обнаружила вредоносное расширение для браузера под названием Rilide, которое нацелено на браузеры на базе Chromium, такие как Google Chrome, Microsoft Edge, Brave и Opera. Rilide маскируется под легитимное расширение Google Drive и способен выполнять различные вредоносные действия, включая мониторинг истории просмотров, создание скриншотов и кражу средств с различных криптовалютных бирж. Вредоносная программа также использует поддельные диалоги, чтобы обманом заставить пользователей раскрыть свои коды двухфакторной аутентификации (2FA).\n\nRilide распространялся посредством двух кампаний. Первая представляла собой вредоносный файл Microsoft Publisher, который был частью Ekipa RAT, троянца удаленного доступа (RAT). Ekipa RAT часто продается на подпольных форумах, а Microsoft устранила недостаток безопасности в феврале 2023 года. Вторая кампания использовала кражу Aurora, которая представляет собой вредоносное ПО как услуга (MaaS), доступное на русскоязычных подпольных форумах. Aurora предназначен для получения данных из нескольких веб-браузеров, криптовалютных кошельков и локальных систем. Aurora также распространялась через кампании, выдававшие себя за законные программы установки Team Viewer и драйверов NVIDIA.\n\nПолезная нагрузка сохранялась в каталоге %temp% с именем файла .exe, состоящим из 10 алфавитно-цифровых символов, и выполнялась с помощью команды start-process PowerShell. Полезная нагрузка была упакована с помощью VMProtect, коммерческого упаковщика, и содержала закодированный в base64 блоб данных, хранящий URL-адрес загрузчика Rilide на основе Rust. Этот загрузчик отвечал за установку расширения Rilide для браузеров на базе Chromium.\n\nRilide использует несколько встроенных функций хрома для проведения XSS-атаки и загрузки внешних ресурсов. Он может перехватывать URL-адреса из текущего домена, захватывать и перехватывать скриншоты активных вкладок, а также заменять подтверждения электронной почты запросами авторизации с устройства, когда пользователь заходит в почтовый ящик через тот же веб-браузер. Более того, он поддерживает функцию автоматического вывода средств, которая обманом заставляет пользователя предоставить код авторизации.\n\nПохожие расширения были обнаружены в объявлениях о продаже, а исходный код был недавно утечен на подпольном форуме из-за спора об оплате. Обращение к домену командно-административного управления ashgrrwt.click привело к дополнительным загрузчикам Rilide, связанным с пользователем GitHub gulantin.\n\nRilide является ярким примером растущей сложности вредоносных расширений браузера и потенциальной опасности, которую они представляют. Несмотря на то, что предстоящее введение в действие манифеста v3 может усложнить деятельность угрожающих субъектов, важно сохранять бдительность и скептицизм при получении незапрашиваемых электронных писем или сообщений, а также оставаться в курсе последних угроз кибербезопасности и лучших практик."
}
{
    "date": "2023-04-04",
    "from_channel": "defcon_news",
    "message": "Remote Code Execution Vulnerability in Azure Pipelines Can Lead To Software Supply Chain Attack\nhttps://www.reddit.com/r/netsec/comments/12bqyl4/remote_code_execution_vulnerability_in_azure/",
    "webpage_description": "Posted by u/roy_6472 - No votes and no comments",
    "webpage_url": "https://www.reddit.com/r/netsec/comments/12bqyl4/remote_code_execution_vulnerability_in_azure/"
}
{
    "date": "2023-04-06",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-20914 ‼\n\nSQL Injection vulnerability found in San Luan PublicCMS v.4.0 allows a remote attacker to execute arbitrary code via the sql parameter.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23870 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in wpdevart Responsive Vertical Icon Menu plugin <= 1.5.8 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23977 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Team Heateor WordPress Social Comments Plugin for Vkontakte Comments and Disqus Comments plugin <= 1.6.1 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23821 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Marcin Pietrzak Interactive Polish Map plugin <= 1.2 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23685 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in RadiusTheme Portfolio â€“ WordPress Portfolio plugin <= 2.8.10 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23686 ‼\n\nAuth. (contributor+) Stored Cross-Site Scripting (XSS) vulnerability in Brett Shumaker Simple Staff List plugin <= 2.2.2 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-47870 ‼\n\nA Cross Site Scripting (XSS) vulnerability in the web SQL monitor login page in Redgate SQL Monitor 12.1.31.893 allows remote attackers to inject arbitrary web Script or HTML via the returnUrl parameter.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-23878 ‼\n\nAuth. (editor+) Stored Cross-Site Scripting (XSS) vulnerability in flippercode WordPress Plugin for Google Maps â€“ WP MAPS plugin <= 4.3.9 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2020-36692 ‼\n\nA reflected XSS via POST vulnerability in report scheduler of Sophos Web Appliance versions older than 4.3.10.4 allows execution of JavaScript code in the victim browser via a malicious form that must be manually submitted by the victim while logged in to SWA.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1827 ‼\n\nA vulnerability has been found in SourceCodester Centralized Covid Vaccination Records System 1.0 and classified as critical. This vulnerability affects unknown code of the file /vaccinated/admin/maintenance/manage_location.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-224842 is the identifier assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-24724 ‼\n\nA stored cross site scripting (XSS) vulnerability was discovered in the user management module of the SAS 9.4 Admin Console, due to insufficient validation and sanitization of data input into the user creation and editing form fields.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-04",
    "from_channel": "defcon_news",
    "message": "Super FabriXss: an RCE vulnerability in Azure Service Fabric Explorer\nhttps://www.malwarebytes.com/blog/news/2023/04/super-fabrixss-an-rce-vulnerability-in-azure-service-fabric-explorer",
    "webpage_description": "Researchers disclosed how they found a remote code execution vulnerability in Azure Service Fabric Explorer.",
    "webpage_url": "https://www.malwarebytes.com/blog/news/2023/04/super-fabrixss-an-rce-vulnerability-in-azure-service-fabric-explorer?utm_source=dlvr.it&utm_medium=twitter"
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-43941 ‼\n\nHitachi Vantara Pentaho Business Analytics Server versions before 9.4.0.1 and 9.3.0.2, including 8.3.x do not correctly protect the Post Analysis service endpoint of the data access plugin against out-of-band XML External Entity Reference.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-28836 ‼\n\nWagtail is an open source content management system built on Django. Starting in version 1.5 and prior to versions 4.1.4 and 4.2.2, a stored cross-site scripting (XSS) vulnerability exists on ModelAdmin views within the Wagtail admin interface. A user with a limited-permission editor account for the Wagtail admin could potentially craft pages and documents that, when viewed by a user with higher privileges, could perform actions with that user's credentials. The vulnerability is not exploitable by an ordinary site visitor without access to the Wagtail admin, and only affects sites with ModelAdmin enabled. For page, the vulnerability is in the \"Choose a parent page\" ModelAdmin view (`ChooseParentView`), available when managing pages via ModelAdmin. For documents, the vulnerability is in the ModelAdmin Inspect view (`InspectView`) when displaying document fields. Patched versions have been released as Wagtail 4.1.4 and Wagtail 4.2.2. Site owners who are unable to upgrade to the new versions can disable or override the corresponding functionality.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "WordPress Paid Memberships Pro 2.9.8 SQL Injection\nhttps://packetstormsecurity.com/files/171661/wppaidmembershipspro298-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171661/wppaidmembershipspro298-sql.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "GLPI 10.0.2 SQL Injection / Remote Code Execution\nhttps://packetstormsecurity.com/files/171656/glpi1002-sqlexec.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171656/glpi1002-sqlexec.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "GLPI Activity Local File Inclusion\nhttps://packetstormsecurity.com/files/171655/glpiactivity310-lfi.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171655/glpiactivity310-lfi.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "GLPI Glpiinventory 1.0.1 Local File Inclusion\nhttps://packetstormsecurity.com/files/171654/glpiinventory101-lfi.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171654/glpiinventory101-lfi.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "GLPI Manageentities Local File Inclusion\nhttps://packetstormsecurity.com/files/171653/glpime402-lfi.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171653/glpime402-lfi.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "defcon_news",
    "message": "Art Gallery Management System Project 1.0 SQL Injection\nhttps://packetstormsecurity.com/files/171643/agmsp10-sql.txt",
    "webpage_description": "Information Security Services, News, Files, Tools, Exploits, Advisories and Whitepapers",
    "webpage_url": "https://packetstormsecurity.com/files/171643/agmsp10-sql.txt"
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1124 ‼\n\nThe Shopping Cart & eCommerce Store WordPress plugin before 5.4.3 does not validate HTTP requests, allowing authenticated users with admin privileges to perform LFI attacks.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1765 ‼\n\nImproper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Akbim Computer Panon allows SQL Injection.This issue affects Panon: before 1.0.2.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2022-27665 ‼\n\nReflected XSS (via AngularJS sandbox escape expressions) exists in Progress Ipswitch WS_FTP Server 8.6.0. This can lead to execution of malicious code and commands on the client due to improper handling of user-provided input. By inputting malicious payloads in the subdirectory searchbar or Add folder filename boxes, it is possible to execute client-side commands. For example, there is Client-Side Template Injection via subFolderPath to the ThinClient/WtmApiService.asmx/GetFileSubTree URI.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-03",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-26529 ‼\n\nAuth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in DupeOff.Com DupeOff plugin <= 1.6 versions.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-02",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1792 ‼\n\nA vulnerability was found in SourceCodester Simple Mobile Comparison Website 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/fields/manage_field.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-224744.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-02",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1791 ‼\n\nA vulnerability has been found in SourceCodester Simple Task Allocation System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file manage_user.php. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-224743.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-02",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1793 ‼\n\nA vulnerability was found in SourceCodester Police Crime Record Management System 1.0. It has been classified as critical. This affects an unknown part of the file /officer/assigncase.php of the component GET Parameter Handler. The manipulation of the argument caseid leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-224745 was assigned to this vulnerability.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
{
    "date": "2023-04-01",
    "from_channel": "cibsecurity",
    "message": "‼ CVE-2023-1789 ‼\n\nImproper Input Validation in GitHub repository firefly-iii/firefly-iii prior to 6.0.0.\n\n📖 Read\n\nvia \"National Vulnerability Database\"."
}
