{
    "date": "2025-01-28",
    "from_channel": "Social_engineering",
    "message": "👨‍💻 Assembler для Хакера.\n\n•  Знать ассемблер раньше было обязательно для каждого хакера. Сейчас — только для лучших в своей профессии. Понимать язык машины не только полезно, но и крайне увлекательно: освоив ассемблер, ты научишься программировать без помощи операционной системы и общаться с «железом» напрямую.\n\n•  Статья ниже представлена в виде объемной \"шпаргалки\" и предназначена для тех, кто уже знает основы этого языка программирования. Но если Вам интересна данная тема и вы хотите начать изучение с нуля, то в сети есть много ценных книг и материала, которые можно найти в свободном доступе. Материал включает в себя следующую информацию:\n\n➡Syntax;\n➡Sections;\n➡Processor Registers;\n➡System Calls;\n➡Strings;\n➡Numbers;\n➡Conditions;\n➡Addressing Modes;\n➡File Handling;\n➡Stack and Memory;\n➡Code Injection Attack;\n➡DLL Injection;\n➡APC Injection;\n➡Valid Accounts;\n➡System Binary Proxy Execution: Rundll32;\n➡Reflective code loading;\n➡Modify Registry;\n➡Process Injection;\n➡Mark-Of-The-Web (MOTW) Bypass;\n➡Access Token Manipulation;\n➡Hijack Execution Flow;\n➡Resources.\n\n•  P.S. На YT есть неплохая серия уроков по сегодняшней теме. Ссылка на плейлист.\n\nS.E. ▪️ infosec.work ▪️ VT"
}
{
    "date": "2025-01-27",
    "from_channel": "Social_engineering",
    "message": "💉 Ставим уколы процессам в Windows.\n\n•  Технологии внедрения своего кода в чужие процессы уже много лет используются различными вредоносными приложениями. В Windows это стало довольно распространенным явлением. Вредонос инжектит фрагменты своего собственного кода в другой запущенный процесс, чтобы затем его выполнить. Как раз об этом и поговорим.\n\n•  На этот раз я поделюсь с Вами очень объемной серией материала с форума XSS, в которой мы рассмотрим различные техники внедрения — продвинутый подход, позволяющий внедрять код в легитимные процессы. Широко используемый в реальных сценариях атак, эти методы обеспечивают скрытное выполнение кода за счет использования привилегий и возможностей целевых процессов. Мы рассмотрим различные техники внедрения с практическими примерами, которые связывают теоретические концепции с их реальными сценариями. \n\n•  Материал разбит на 6 частей:\n\n➡Часть 1: Инъекция шелл-кода;\n➡Часть 2: DLL-инъекция;\n➡Часть 3: Инъекция через Native API;\n➡Часть 4: Системные вызовы;\n➡Часть 5: APC-инъекция;\n➡Часть 6: Методы инъекции кода.\n\n➡️ Скачать весь материал можно в нашем облаке.\n\n➡ Источник: https://xss.is\n➡ Авторы: @shqnx и @voldemort\n\n•  Учитывайте, что данный материал имеет ознакомительный характер и предназначен для специалистов по безопасности, которые проводят тестирование в рамках контракта. Всегда думайте головой и не нарушайте закон. Всем добра ❤\n\nS.E. ▪️ infosec.work ▪️ VT"
}
{
    "date": "2025-01-27",
    "from_channel": "it_secur",
    "message": "Часть 6: Методы инъекции кода.\n\n➖➖➖➖➖➖\n\n💉 Ставим уколы процессам в Windows.\n\n•  Очередная годнота с форума XSS. На этот раз делюсь с Вами очень обьемной серией материала, в которой мы рассмотрим различные техники внедрения — продвинутый подход, позволяющий внедрять код в легитимные процессы. Широко используемый в реальных сценариях атак, эти методы обеспечивают скрытное выполнение кода за счет использования привилегий и возможностей целевых процессов. Мы рассмотрим различные техники внедрения с практическими примерами, которые связывают теоретические концепции с их реальными сценариями.\n\n➡️ Источник: https://xss.is\n➡️ Авторы: @shqnx и @voldemort\n\n#XSS"
}
{
    "date": "2025-01-12",
    "from_channel": "it_secur",
    "message": "📰 Inception #8.\n\n•  Новый выпуск журнала Inception, который создавался участниками форума XSS.IS (ex DaMaGeLaB). Включает в себя много ценной информации для этичных хакеров и ИБ специалистов:\n\n➡Интервью с гостем данного выпуска. Bo0om!\n➡XSSLite: обзор стиллера с веб панелью;\n➡Комикс. Временной скачек;\n➡XSS.is RFB Bruter: очередной брутер или добываем VNC-доступы без затрат;\n➡Дерева переписыватель;\n➡Обзор стиллера на Powershell;\n➡Patching syscall table reference (by lenalew).\n\n➡ Топик на форуме с обсуждением выпуска: https://xss.is/threads/130315\n\n#XSS #Inception",
    "urls": []
}
{
    "date": "2025-01-10",
    "from_channel": "it_secur",
    "message": "•  Ребятушки, в продаже появилась новая книга \"Веб-сервер глазами хакера. 4-е изд.\", которая содержит много полезной и актуальной информации для ИБ специалистов, разрабов и системных администраторов. Если быть точнее, то содержание такое:\n\n - Проблемы безопасности веб-серверов;\n - Ошибки в сценариях на PHP;\n - SQL-инъекции;\n - Методы обхода капчи;\n - Примеры ошибок на реальных веб-сайтах;\n - Как искать и исправлять ошибки в сценариях;\n - DoS-атаки на веб-сайт;\n - CSRF- и XSS-уязвимости.\n\n•  Именно эту книгу и разыграем! Единственное, что от Вас требуется - нажать на кнопку под этим постом. Доставку беру на себя. Итоги подведем в воскресенье (12.01 в 18:00), при помощи бота, который рандомно выберет 5 победителей. Всем удачи и хороших выходных ❤️\n\nP.S. Не забывайте ставить огонек под этим постом 🔥 \n\n#Конкурс"
}
