{
    "date": "2020-07-31",
    "from_channel": "Social_engineering",
    "message": "​👾 XSS и XSStrike.\n\n🖖🏻 Приветствую тебя user_name.\n\n💬 XSS — тип атаки, которая заключается во внедрении вредоносного кода в страницу веб-приложения. При открытии такой страницы, на стороне пользователя, вредоносный код будет выполнен. XSS атаки позволяют внедрять в страницу произвольное содержимое, перехватывать cookie, получать доступ в закрытые разделы сайта и даже получить тебе привилегии администратора веб-ресурса.\n\n📌 Разновидность XSS:\n\n➖ Хранимые — вредоносный код сохраняется на сервере и загружается с него каждый раз, когда жертва открывает вредоносную страницу.\n➖ Отображаемые — вредоносная строка является частью запроса жертвы к веб-сайту. Сайт принимает и вставляет эту вредоносную строку в отправляемый ответ обратно жертве.\n➖ XSS в DOM-модели — представляет собой вариант как хранимой, так и отображаемой XSS-атаки. В этой XSS-атаке вредоносная строка не обрабатывается браузером жертвы, пока настоящий JavaScript веб-сайта не выполнится.\n\n☝🏻 Теперь поговорим о XSStrike — это первый сканер XSS для генерации собственных пэйлоадов. Он распознаёт ответ с помощью нескольких анализаторов, и затем обрабатывает полезные данные, которые гарантированно будут работать с помощью контекстного анализа, интегрированного в механизм фаззинга.\n\n📌 Возможности XSStrike: \n\n➖ Интеллектуальная генерация пэйлоадов.\n➖ Поддержка файлов cookie.\n➖ Скрытое обнаружение параметров.\n➖ Пэйлоады ручной работы для фильтрации и WAF-уклонения.\nи многое другое....\n\n👨🏻‍💻 Читать информацию по установке и использованию.\n\n🧷 GitHub репозиторий.\n\n#XSStrike — мощный и многофункциональный инструмент, который может модифицировать заголовки не только в параметрах, но и с использованием текстового редактора, а также добавлять собственный набор полезной нагрузки.\n\nДелись с друзьями и оставайся с нами. Ваш @Social_Engineering",
    "webpage_url": "https://telegra.ph/file/4f0f502635389db5bd696.jpg"
}
{
    "date": "2020-07-14",
    "from_channel": "Social_engineering",
    "message": "​🔖 Подборка полезной информации и ресурсов.\n\n💬 Приветствую тебя user_name.\n\n📌 Сегодня Я собрал для тебя достаточно полезной информации для изучения, в различных сферах. Надеюсь, ты найдешь то, что так давно искал. Добавляй в избранное, что бы не потерять.\n\n➖ Более 100К ресурсов на различные темы. Начиная от книг по программированию,  заканчивая различными блогами разработчиков ПО.\nhttps://github.com/sindresorhus/awesome\n\nhttps://twitter.com/awesome__re\n\n➖ Огромное количество ресурсов на тему поиска и сбора информации из открытых источников.\nhttps://github.com/jivoi/awesome-osint\n\n➖  Информационная безопасность, форензика, криптография, CTF и т.д.\nhttps://github.com/carpedm20/awesome-hacking\n\n➖ Список Ханипотов ( Ловушек для хакеров ). Руководства, инструменты, инструкции и т.д.\nhttps://github.com/paralax/awesome-honeypots\n\n➖ Список инструментов и ресурсов для анализа вредоносных программ.\nhttps://github.com/rshipp/awesome-malware-analysis\n\n➖ Список фреймворков, библиотек, ПО и ресурсов связанных с Python.\nhttps://github.com/vinta/awesome-python\n\n➖  Список различных PHP библиотек, ресурсов и шпаргалок.\nhttps://github.com/ziadoz/awesome-php\n\n➖  Список CTF, библиотек, ресурсов, ПО и учебных пособий.\nhttps://github.com/apsdehal/awesome-ctf\n\n➖ Коллекция ресурсов, связанных с безопасностью Android + софт и различные гайды.\nhttps://github.com/ashishb/android-security-awesome\n\nhttps://github.com/JStumpp/awesome-android\n\n➖  Безопасность веб-приложений. XSS, CSV и SQL-инъекции, ClickJacking и еще сотни направлений.\nhttps://github.com/qazbnm456/awesome-web-security\n\n➖  Список лучших приложений и инструментов для Windows.\nhttps://github.com/Awesome-Windows/Awesome\n\n➖  Список приложений и инструментов для Linux.\nhttps://github.com/aleksandar-todorovic/awesome-linux\n\n➖  Набор инструментов, проектов и ресурсов Raspberry Pi.\nhttps://github.com/thibmaek/awesome-raspberry-pi\n\n➖  Сборник ресурсов по пентесту, от инструментов до книг.\nhttps://github.com/enaqx/awesome-pentest\n\n‼️ P.S. Данный список не претендует на полноту, если у тебе есть чем дополнить этот список, пиши в бота обратной связи, в описании канала. Ну а Я напоминаю, что другую полезную информацию ты можешь найти по хэштегам в нашей группе #Подборка #Linux #Анонимность #Книга #Курс #Пентест #CTF #Raspberry #Android #Форензика\n\nДелись с друзьями и оставайся с нами. Ваш @Social_Engineering",
    "webpage_url": "https://telegra.ph/file/7a945558bfe385693b50a.jpg"
}
{
    "date": "2020-07-02",
    "from_channel": "Social_engineering",
    "message": "​👨🏻‍💻 Интерактивный курс по веб-уязвимостям.\n\n💬 Приветствую тебя user_name.\n\n➖ Hacksplaining представляет каталогизированный и наглядный онлайн-туториал по основным веб-уязвимостям. По каждой уязвимости представлено подробное описание, насколько часто встречается, как сложно ее эксплуатировать и уровень ее критичности. \n\n☝🏻 К каждой уязвимости приложено подробное описание, вектор эксплуатации, уязвимый код и рекомендации по устранению и защите. В качестве примера в статье приведен разбор одного из заданий по взлому виртуального онлайн-банкинга с помощью эксплуатации sql-инъекции.\n\n👾 Рассматриваемые уязвимости: SQL Injection, Cross-site Scripting (XSS), Command Execution, Clickjacking, Cross-site Request Forgery, Directory Traversal, File Upload Vulnerabilities, Broken Access Control, Open Redirects, Unencrypted Communication, XML Bombs и многое другое....\n\n🧷 https://www.hacksplaining.com/lessons\n\n👤 Курс будет полезен для специалистов по информационной безопасности, это неплохая шпаргалка и средство визуализации веб-уязвимостей с хорошим описанием и пошаговой демонстрацией вектора атаки.\n\n📌 В качестве дополнения к эксплуатации вектора SQL-инъекция рекомендую ознакомиться со следующим материалом: \n\n➖ Шпаргалка по SQL-инъекциям (1)\n\n➖ Шпаргалка по SQL-инъекциям (2)\n\n➖ Шпаргалка по SQL-инъекциям (3)\n\n‼️ Еще больше полезной информации, ты можешь найти по хэштегу в нашей группе #sql #OWASP #Курс\n\nДелись с друзьями и оставайся с нами. Ваш @Social_Engineering",
    "webpage_url": "https://telegra.ph/file/d7e79d0c70b15631d8649.jpg"
}
