{
    "date": "2022-02-27",
    "from_channel": "physics_lib",
    "message": "📗 Этичный хакинг. Практическое руководство по взлому [2022] Грэм Дэниэль\n\n📘 Ethical Hacking: A Hands-on Introduction to Breaking In [2021] Daniel G. Graham\n\n💾 Скачать книгу\n\n💡 Друзья, мы собрали на книгу, спасибо всем, кто участвовал во складчине. \n\nYou’ll work with a wide range of professional penetration testing tools—and learn to write your own tools in Python—as you practice tasks like:\n\n• Deploying the Metasploit framework’s reverse shells and embedding them in innocent-seeming files\n• Capturing passwords in a corporate Windows network using Mimikatz\n• Scanning (almost) every device on the internet to find potential victims\n• Installing Linux rootkits that modify a victim’s operating system\n• Performing advanced Cross-Site Scripting (XSS) attacks that execute sophisticated JavaScript payloads"
}
{
    "date": "2022-02-25",
    "from_channel": "Social_engineering",
    "message": "​👨🏻‍💻 Хак в 1 клик. Швейцарский нож из мира сканеров.\n\n🖖🏻 Приветствую тебя user_name.\n\n•  Burp Suite — комбайн, который умеет работать как прокси, сканер уязвимостей, паук-краулер, репитер запросов или платформа для множества плагинов. Сканер разработала компания PortSwigger и выпустила в двух редакциях: Community (бесплатно) и Professional (400 долларов) (про корпоративную версию говорить не будем). Pro версия отличается наличием в комплекте большого количества плагинов для Burp Intruder, наличием автоматического сканера и отсутствием ограничений в BApp Store.\n\n•  Имеется неплохой GUI с удобными вкладками, автоматические модули для подбора паролей, идентификаторов, фаззинга, кодировщики и раскодировщики данных в разных форматах. Обзоров Burp не делал только ленивый, так что сегодня я собрал для тебя небольшую подборку полезного материала, для изучения этого инструмента:\n\n🧷 Скачать свежую и ломаную версию инструмента: https://t.me/RalfHackerChannel/1174\n\n•  Обзор: https://habr.com/ru/post/328382/\n\n•  Полезный материал для изучения:\nBurp Suite for Pentester: Web Scanner & Crawler\nBurp Suite for Pentester – Fuzzing with Intruder (Part3)\nBurp Suite for Pentester – Fuzzing with Intruder (Part2)\nBurp Suite for Pentester – Fuzzing with Intruder (Part1)\nBurp Suite for Pentester – XSS Validator\nBurp Suite for Pentester – Configuring Proxy\nBurp Suite for Pentester: Burp Collaborator\nBurp Suite For Pentester: HackBar\nBurp Suite for Pentester: Burp Sequencer\nBurp Suite for Pentester: Turbo Intruder\nEngagement Tools Tutorial in Burp suite\nPayload Processing Rule in Burp suite (Part2)\nPayload Processing Rule in Burp suite (Part1)\nBeginners Guide to Burpsuite Payloads (Part2)\nBeginners Guide to Burpsuite Payloads (Part1)\nBurpsuite Encoder & Decoder Tutorial\nBurp Suite for Pentester: Active Scan++\nBurp Suite for Pentester: Software Vulnerability Scanner\nBurp Suite for Pentester: Burp’s Project Management\nBurp Suite for Pentester: Repeater\n\n•  Плагины (Список не претендует на полноту)\nSQLiPy - поможет с автоматизацией SQL-инъекций.\nActiveScan++ - расширяет стандартный перечень проверок, которые выполняются при работе активного и пассивного сканера.\nBackslash Powered Scanner - манипулируя всевозможными параметрами из запроса, расширение пытается выявить нестандартное поведение сервера. Такие аномалии могут помочь при обнаружении как простых уязвимостей типа error-based SQL-инъекций, так и сложных XSS-инъекций с обходом встроенного WAF.\nAuthMatrix и Autorize - проверка на корректность логики распределения прав доступа в приложении.\nJ2EEScan - обнаруживает и тестирует различные J2EE (Java 2 Enterprise Edition) приложения на наличие известных уязвимостей.\nOAUTHScan - обеспечивает автоматическую проверку безопасности приложений, которые реализуют стандарты OAUTHv2 и OpenID.\n\n•  Cheat Sheet:\nBurp Suite Cheat Sheet.\nBurp Suite Cheat Sheet V2.\nBurp Suite Cheat Sheet V3.\nBurp Suite Cheat Sheet V4.\nBurp Suite Cheat Sheet V5.\nBurp Suite Cheat Sheet V6.\n\n•  Книга: A Complete Guide to Burp Suite: Learn to Detect Application Vulnerabilities.\n\n•  Еще больше полезного материала: https://t.me/burpsuite + Чат в описании.\n\nТвой S.E. #Burp #Пентест #hack.",
    "webpage_url": "https://telegra.ph/file/bb62c7ed919242f6f5cc6.jpg"
}
{
    "date": "2022-02-24",
    "from_channel": "Social_engineering",
    "message": "​🔖 S.E.Подборка. HackTheBox CTF Cheatsheet. RU.\n\nЕдинственный способ стать умнее — играть с более умным противником.\n\n🖖🏻 Приветствую тебя user_name.\n\n•  Собрал хорошую и большую подборку прохождений HTB, которая поможет прокачать твой скилл и получить новые знания в различных аспектах пентеста. Подборку разделил по уровням сложности, надеюсь будет полезно:\n\nHack The Box. Уровень Easy:\n•  Прохождение Traceback. Бэкдор, LUA, SSH.\n•  Прохождение Omni. Ломаем легенький Windows IoT.\n•  Прохождение Buff. RCE в CMS Gym и в CloudMe.\n•  Прохождение Tabby. RCE в Tomcat, и повышаем привилегии через LXD.\n•  Прохождение Blunder. Ломаем Bludit CMS.\n•  Прохождение Remote. NFS, RCE в CMS Umbraco и LPE через UsoSvc.\n•  Прохождение Sauna. LDAP, AS-REP Roasting, AutoLogon, DCSync атака.\n•  Прохождение Nest. NTFS потоки, реверс C# и бродилка по SMB.\n•  Прохождение Traverxec. RCE в веб-сервере nostromo, техника GTFOBins.\n•  Прохождение Forest. AS-REP Roasting, атаки DCSync и Pass-The-Hash.\n•  Прохождение Postman. Redis и WebMin.\n\nHack The Box. Уровень Medium:\n•  Прохождение лаборатории Professional Offensive Operations. Пентест Active Directory.\n•  Прохождение Monteverde. Брут SMB и LPE через Azure Admins.\n•  Прохождение OpenKeys. Ломаем виртуалку OpenBSD.\n•  Прохождение SneakyMailer. Фишинговая рассылка, LPE через PyPI и GTFOBins pip3.\n•  Прохождение Fuse. RPC, принтеры и опасная привилегия SeLoadDriverPrivilege.\n•  Прохождение Cache. RCE в OpenEMR, memcached и docker.\n•  Прохождение Admirer. Уязвимость в Admirer и RCE через подмену переменной среды.\n•  Прохождение Magic. Password spraying. Mysqldump и LPE через sysinfo.\n•  Прохождение Cascade. LDAP и удаленные объекты Active Directory.\n•  Прохождение Book. XSS to LFI через PDF и LPE через Logrotate.\n•  Прохождение Resolute. Password spraying. От DnsAdmin до SYSTEM.\n•  Прохождение Obscurity. OS Command Injection и Race Condition.\n•  Прохождение Mango. NoSQL инъекция и LPE через JJS.\n•  Прохождение Sniper. RFI и вредоносный CHM документ.\n•  Прохождение Bitlab. Слабая JS обфускация, GIT и реверс Windows приложения.\n\nHack The Box. Уровень Hard:\n•  Прохождение Compromised. RCE LiteCart и бэкдор pam_unix.\n•  Прохождение Unbalanced. Rsync, EncFS, Squid, XPath инъекция и RCE в Pi-hole.\n•  Прохождение Intanse. Flask, атака HLE, SQL инъекция, SNMP to RCE, Ret2Libc.\n•  Прохождение Blackfield. Захват контроллера домена через SMB и RPC, LPE через теневую копию.\n•  Прохождение Travel. Memcache+SSRF=RCE, LPE через LDAP.\n•  Прохождение Quick. QUIC HTTP/3, XSLT инъекция, Race condition.\n•  Прохождение Oouch. OAuth2, RCE в uWSGI и LPE через DBUS.\n•  Прохождение Forwardslash. LFI, backup и шифрованный том.\n•  Прохождение Control. SQL инъекция и LPE через права на службу.\n•  Прохождение Registry. Docker, RCE в CMS Bolt и Restic.\n•  Прохождение Scavenger. DNS, FTP и следы другого взлома.\n•  Прохождение Zetta. FXP, IPv6, rsync, Postgres и SQLi.\n•  Прохождение RE. Metasploit, нагрузка в офисном документе, Zip Slip атака, немного о PowerSploit и токенах.\n\nHack The Box. Уровень Insane:\n•  Прохождение Laser. Jetdirect, RPC и кража SSH.\n•  Прохождение Dyplesher. Memcached, Gogs, RCE через создание плагина и LPE через AMQP.\n•  Прохождение Multimaster. Burp+Sqlmap. AD users from MSSQL. Уязвимость в VSCode. AMSI bypass и CVE ZeroLogon.\n•  Прохождение Fatty. Реверс и рекомпиляция клиент-серверного приложения. Java десериализация.\n•  Прохождение PlayerTwo. Twirp, 2FA bypass, Off-By-One атака.\n•  Прохождение Rope. PWN. Форматные строки и ROP используя pwntools.\n•  Прохождение Bankrobber. XSS, SQL инъекция, CSRF, port forwarding.\n\nДополнительная информация:\n•  https://github.com/Ignitetechnologies/HackTheBox-CTF-Writeups\n•  https://github.com/Ignitetechnologies/Privilege-Escalation\n•  https://github.com/Ignitetechnologies/Vulnhub-CTF-Writeups\n•  https://github.com/Ignitetechnologies/TryHackMe-CTF-Writeups\n•  Полный список #CTF площадок, можешь найти тут: https://t.me/Social_engineering/1316\n\nТвой S.E. #Пентест #CTF",
    "webpage_url": "https://telegra.ph/file/88927351e998e0191225a.jpg"
}
{
    "date": "2022-02-09",
    "from_channel": "aptreports",
    "message": "#technique \nExploring Windows UAC Bypasses: Techniques and Detection Strategies\n\nhttps://elastic.github.io/security-research/whitepapers/2022/02/03.exploring-windows-uac-bypass-techniques-detection-strategies/article/",
    "urls": []
}
{
    "date": "2022-02-03",
    "from_channel": "aptreports",
    "message": "Thu, 03 Feb 2022 20:56:31 +0000 Operation EmailThief: Active Exploitation of Zero-day XSS Vulnerability in Zimbra https://www.volexity.com/blog/2022/02/03/operation-emailthief-active-exploitation-of-zero-day-xss-vulnerability-in-zimbra/",
    "urls": [],
    "webpage_description": "[UPDATE] On February 4, 2022, Zimbra provided an update regarding this zero-day exploit vulnerability and reported that a hotfix for 8.8.15 P30 would be available on February 5, 2022. This vulnerability was later assigned CVE-2022-24682 and was fixed in version 8.8.15P30 Update 2 of Zimbra Collaboration Suite. In December 2021, through its Network Security Monitoring service, Volexity identified a series of targeted spear-phishing campaigns against one of its customers from a threat actor it tracks as TEMP_Heretic. Analysis of the emails from these spear phishing campaigns led to a discovery: the attacker was attempting to exploit a zero-day cross-site scripting (XSS) vulnerability in the Zimbra email platform. Zimbra is an open source email platform often used by organizations as an alternative to Microsoft Exchange. The campaigns came in multiple waves across two attack phases. The initial phase was aimed at reconnaissance and involved emails designed to simply track if a target […]",
    "webpage_url": "https://www.volexity.com/blog/2022/02/03/operation-emailthief-active-exploitation-of-zero-day-xss-vulnerability-in-zimbra/"
}
